@echo off
setlocal enabledelayedexpansion

:: ==============================================================================
::
:: НАЗВАНИЕ:    logger.cmd
:: ОПИСАНИЕ:    Логирование работы скриптов при их выполнении.
:: АВТОР:       Наиль Марков
:: ВЕРСИЯ:      2.0 (14.07.2026)
::
:: ОПИСАНИЕ:    1. Генерирует имя лог-файла на основе текущей даты (формат: process_log_ДД-ММ-ГГГГ.log).
::              2. Функция ":function_write_continue" принимает два параметра: [Уровень лога] и [Сообщение].
::                 Ведет основное логирование.
::              3. Добавляет в файл выполнение команд.
::
:: ==============================================================================

call :function_write_continue %1 %2

goto :eof

:: Основная функция логирования
:function_write_continue

set "LEVEL=%~1"
set "MESSAGE=%~2"

:: Получение текущего времени
for /f "tokens=2 delims==" %%I in ('wmic os get localdatetime /value') do set "t=%%I"
set "CURRENT_TIME=%t:~8,2%:%t:~10,2%:%t:~12,2%"

:: Запись в файл
echo [%CURRENT_TIME%] [%LEVEL%] %MESSAGE% >> %FILE_LOG%

goto :eof