@echo off
:: ========================================================================
::
:: НАЗВАНИЕ:    path.cmd
:: ОПИСАНИЕ:    Создание переменных для дальнейшего использования в скриптах.
:: АВТОР:       Наиль Марков
:: ВЕРСИЯ:      2.0 (07.07.2026)
:: 
:: ТРЕБОВАНИЯ:  Windows / Windows Server. Наличие прав на чтение/запуск в папках.
:: ЛОГИКА:      Отсутствует.
::
:: ========================================================================

:: ==== PATHS OR DIRECTORIES ====

:: ==== Paths ====
set DIR_CURRENT="D:\cmd\operation_error"
set DIR_LOGS=%DIR_CURRENT%\logs


:: ==== FILES ====

:: ==== txt ====
set FILE_LOG=%DIR_LOGS%\log_today.txt
